china-djyos/djyos/bsp/cpudrv/stm32/f1/src/spi/cpu_peri_spi.c
// =============================================================================
// 功能: 中断使能和失能函数
// 参数: tpSPI,被操作的寄存器组指针
// 返回: 无
// =============================================================================
// static void __SPI_IntEnable(volatile tagSpiReg *Reg,u32 IntSrc)
// {
//     Reg->CR2 |= IntSrc;
// }
// static void __SPI_IntDisable(volatile tagSpiReg *Reg,u32 IntSrc)
// {
//     Reg->CR2 &= ~IntSrc;
// }


static u32 __SPI_GetPoart(u32 BaseAddr)
{
    u32 SPIPort = 0;
    for(SPIPort = 0; SPIPort < CN_SPI_NUM; SPIPort++)
    {
        if(BaseAddr == (u32)tg_SpiReg[SPIPort])
            break;
    }
    return SPIPort;
}

// =============================================================================
// 功能: 根据APB2的时钟和Fre计算BR寄存器的写入值
// 参数: Fre,想要配置的SPI时钟
// 返回: BR值
// =============================================================================
static u32 __SPI_BrCal(u32 Fre)
{
    u32 temp;
    temp = CN_CFG_PCLK2/Fre;
    if(temp >= 256)         temp = 7;
    else if(temp >= 128)    temp = 6;
    else if(temp >= 64)     temp = 5;
    else if(temp >= 32)     temp = 4;
    else if(temp >= 16)     temp = 3;
    else if(temp >= 8)      temp = 2;
    else if(temp >= 4)      temp = 1;
    else                    temp = 0;

    return temp;
}

// =============================================================================
// 功能：SPI时钟配置函数，时钟来源为50M，经SCR和CPSR分频得到时钟，时钟计算公式为：
//       SCK =  PCLK / (CPSDVSR *[SCR+1])
// 参数：spi_dev，设备句柄
//      spiclk，欲配置的时钟速度，单位为Hz
// 返回：true=成功，false=失败
// 说明：此驱动固定SCR = 1;而根据手册，CPSDVSR必须为2-254的偶数，因此，频率范围为
//       12.5M ~ 100kHz
// =============================================================================
static void __SPI_SetClk(volatile tagSpiReg *Reg,u32 Fre)
{
    u8 br;
    br = (u8)__SPI_BrCal(Fre);
    Reg->CR1 &= ~SPI_CR1_SPE;
    Reg->CR1 &= ~SPI_CR1_BR;
    Reg->CR1 |= br<<3;
}

// =============================================================================
// 功能：SPI引脚初始化，初始化为外设使用，包括时钟和引脚
// 参数：spi_no,SPI控制器号
// 返回：无
// =============================================================================
// static void __SPI_GpioInit(u32 BaseAddr)
// {

//     u8 SPIPort;

//     // 根据基地址找对应的端口号
//     for(SPIPort = 0; SPIPort < CN_SPI_NUM; SPIPort++)
//     {
//         if(BaseAddr == (u32)tg_SpiReg[SPIPort])
//             break;
//     }
//     switch (SPIPort)
//     {
//         case CN_SPI1:

//             // RCC->APB2ENR |= RCC_APB2ENR_SPI1EN; // 使能SPI1时钟

//             // RCC->APB2RSTR |= RCC_APB2RSTR_SPI1RST; // 复位SPI1
//             // RCC->APB2RSTR &= ~RCC_APB2RSTR_SPI1RST; // 停止复位SPI1
//             __HAL_RCC_SPI1_CLK_ENABLE();
//             break;

//         case CN_SPI2:
//             // RCC->APB1ENR |= RCC_APB1ENR_SPI2EN; // 使能SPI2

//             // RCC->APB1RSTR |= RCC_APB1RSTR_SPI2RST; // 复位SPI1
//             // RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI2RST; // 停止复位SPI1
//             __HAL_RCC_SPI2_CLK_ENABLE();
//             break;

//         case CN_SPI3:
//             // RCC->APB1ENR |= RCC_APB1ENR_SPI3EN; // 使能SPI3
//             // RCC->APB1RSTR |= RCC_APB1RSTR_SPI3RST; // 复位SPI1
//             // RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI3RST; // 停止复位SPI1
//             __HAL_RCC_SPI3_CLK_ENABLE();
//             break;

//         default:
//             break;
//     }


// }

// =============================================================================
// 功能：SPI控制寄存器参数配置，如PHA和CPOL、时钟等，根据各种寄存器而异
// 参数：tpSPI,SPI控制器基址
//       ptr,参数指针
// 返回：无
// =============================================================================
static void __SPI_Config(volatile tagSpiReg *Reg,tagSpiConfig *ptr)
{
    __SPI_SetClk(Reg,ptr->Freq);

    //set the PHA
    if(ptr->Mode & SPI_CPHA)
    {
        Reg->CR1 |= SPI_CR1_CPHA;
    }
    else
    {
        Reg->CR1 &= ~SPI_CR1_CPHA;
    }
    //set the cpol
    if(ptr->Mode & SPI_CPOL)
    {
        Reg->CR1 |= SPI_CR1_CPOL;
    }
    else
    {
        Reg->CR1 &= ~SPI_CR1_CPOL;
    }

    if(ptr->CharLen == 16)
    {
        Reg->CR1 |= SPI_CR1_DFF;
    }
    else
    {
        Reg->CR1 &= ~SPI_CR1_DFF;
    }
    if(ptr->ShiftDir == SPI_SHIFT_LSB)
    {
        Reg->CR1 |= SPI_CR1_LSBFIRST;
    }
    else
    {
        Reg->CR1 &= ~SPI_CR1_LSBFIRST;
    }
}

// =============================================================================
// 功能: SPI默认硬件初始化配置，主要是时钟配置和GPIO写保护引脚配置
// 参数: RegBaseAddr,寄存器基址
// 返回: 无
// =============================================================================
static void __SPI_HardConfig(u32 BaseAddr)
{
    u32 SPIPort = __SPI_GetPoart(BaseAddr);
    
    switch (SPIPort)
    {
        case CN_SPI1:
            __HAL_RCC_SPI1_CLK_ENABLE();
            break;

        case CN_SPI2:
            __HAL_RCC_SPI2_CLK_ENABLE();
            break;

        case CN_SPI3:
            __HAL_RCC_SPI3_CLK_ENABLE();
            break;

        default:
            break;
    }

    SPI_Handler[SPIPort].Instance=BaseAddr;
    //    Mode不能直接写SPI_MODE_MASTER或SPI_MODE_SLAVE，以为spibus中也定义了一样的宏
    SPI_Handler[SPIPort].Init.Mode=SPI_CR1_MSTR | SPI_CR1_SSI;             //设置SPI工作模式，设置为主模式
    SPI_Handler[SPIPort].Init.Direction=SPI_DIRECTION_2LINES;   //设置SPI单向或者双向的数据模式:SPI设置为双线模式
    SPI_Handler[SPIPort].Init.DataSize=SPI_DATASIZE_8BIT;       //设置SPI的数据大小:SPI发送接收8位帧结构
    SPI_Handler[SPIPort].Init.CLKPolarity=SPI_POLARITY_HIGH;    //串行同步时钟的空闲状态为高电平
    SPI_Handler[SPIPort].Init.CLKPhase=SPI_PHASE_2EDGE;         //串行同步时钟的第二个跳变沿（上升或下降）数据被采样
    SPI_Handler[SPIPort].Init.NSS=SPI_NSS_SOFT;                 //NSS信号由硬件（NSS管脚）还是软件（使用SSI位）管理:内部NSS信号有SSI位控制
    SPI_Handler[SPIPort].Init.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_256;//定义波特率预分频的值:波特率预分频值为256
    SPI_Handler[SPIPort].Init.FirstBit=SPI_FIRSTBIT_MSB;        //指定数据传输从MSB位还是LSB位开始:数据传输从MSB位开始
    SPI_Handler[SPIPort].Init.TIMode=SPI_TIMODE_DISABLE;        //关闭TI模式
    SPI_Handler[SPIPort].Init.CRCCalculation=SPI_CRCCALCULATION_DISABLE;//关闭硬件CRC校验
    SPI_Handler[SPIPort].Init.CRCPolynomial=7;                  //CRC值计算的多项式
    HAL_SPI_Init(&SPI_Handler[SPIPort]);//初始化
    
    __HAL_SPI_ENABLE(&SPI_Handler[SPIPort]);                    //使能SPI2

