china-djyos/djyos/bsp/cpudrv/stm32/f1/src/spi/cpu_peri_spi.c
}

// =============================================================================
// 功能：SPI片选使能，使片选有效,若控制器有具体的配置片选寄存器，可直接返回
// 参数：Reg，本模块内即SPI寄存器基址
//       cs,片选线
// 返回：无
// 说明：SPI控制器上只引出了一个CS，若需要接多个CS，则必须应用程序自己控制CS
// =============================================================================
static bool_t __SPI_BusCsActive(tagSpiReg *Reg, u8 cs)
{
    u8 SPIPort;
    for(SPIPort = 0; SPIPort < CN_SPI_NUM; SPIPort++)
    {
        if(Reg == tg_SpiReg[SPIPort])
            break;
    }
    return Board_SpiCsCtrl(SPIPort,cs,0);
}
// =============================================================================
// 功能：SPI片选失能，使片选无效
// 参数：Reg，本模块内即SPI寄存器基址
//       cs,片选线
// 返回：无
// =============================================================================
static bool_t __SPI_BusCsInActive(tagSpiReg *Reg, u8 cs)
{
    u8 SPIPort;
    for(SPIPort = 0; SPIPort < CN_SPI_NUM; SPIPort++)
    {
        if(Reg == tg_SpiReg[SPIPort])
            break;
    }
    return Board_SpiCsCtrl(SPIPort,cs,1);
}

// =============================================================================
// 功能：SPI总线控制回调函数，被上层调用，目前只实现对SPI时钟频率配置
// 参数：specific_flag,个性标记，本模块内即IIC寄存器基址
//       cmd,命令
//       data1,data2,数据，与具体命令相关
// 返回：无
// =============================================================================
static s32 __SPI_BusCtrl(tagSpiReg *Reg,u32 cmd,ptu32_t data1,ptu32_t data2)
{
    s32 result = 1;
    if( (Reg != tg_SpiReg[CN_SPI1]) && (Reg != tg_SpiReg[CN_SPI2])
         && (Reg != tg_SpiReg[CN_SPI3])
        )
        return 0;

    switch(cmd)
    {
    case CN_SPI_SET_CLK:
        __SPI_SetClk(Reg,data1);
        break;

    case CN_SPI_CS_CONFIG:
        __SPI_Config(Reg,(tagSpiConfig *)data1);
        break;

    case CN_SPI_SET_AUTO_CS_EN:
        // 硬件上如果有自动产生CS的配置
        break;

    case CN_SPI_SET_AUTO_CS_DIS:
        break;

    case CN_SPI_SET_POLL:
        Reg->CR2 &= ~(3<<6);
           break;

    // case CN_SPI_SET_INT:
    //     Reg->CR2 |= (3<<6);
    //        break;
    default:        break;
    }
    return result;
}

// =============================================================================
// 功能：读SPI接收寄存器，轮询方式,被__SPI_TxRxPoll调用
// 参数：Reg,寄存器基址
// 返回：读到的数据
// =============================================================================
// static s32 __SPI_Read( tagSpiReg * Reg )
// {
//     u32 time = CN_TIMEOUT;
//     while ( ( (Reg->SR & SPI_SR_RXNE) == 0 ) && (time > 0))
//     {
//         time --;
//         DJY_DelayUs(1);
//     }

//     if(time == 0)
//         return -1;
//     return *((__IO u8 *)&Reg->DR) & 0xFFFF;
// }

// =============================================================================
// 功能：写SPI发送寄存器，轮询方式,被__SPI_TxRxPoll调用
// 参数：Reg,寄存器基址；wData，写数据
// 返回：无
// =============================================================================
// static s32 __SPI_Write( tagSpiReg * Reg,u8 wData )
// {
//     u32 time = CN_TIMEOUT;
//     /* Send data */
//     while ( ( (Reg->SR & SPI_SR_TXE) == 0 ) && (time > 0) )
//     {
//         time --;
//         DJY_DelayUs(1);
//     }
//     if(time == 0)
//         return -1;
//     *((volatile u8 *)&Reg->DR) = wData;
// //    Reg->DR = wData;
//     return 0;
// }

//static u16 __SPI_WR( tagSpiReg * Reg,u8 Wdata)
//{
//
//    u32 time = CN_TIMEOUT;
//    /* Send data */
//    while ( ( (Reg->SR & SPI_SR_TXE) == 0 ) && (time > 0) )
//    {
//        time --;
//        DJY_DelayUs(1);
//    }
//    if(time == 0)
//        return -1;
//    *((volatile u8 *)&Reg->DR) = Wdata;
//    time = CN_TIMEOUT;
//    while ( ( (Reg->SR & SPI_SR_RXNE) == 0 ) && (time > 0))
//    {
//        time --;
//        DJY_DelayUs(1);
//    }
//    if(time == 0)
//        return -1;
//
//    return *((__IO u8 *)&Reg->DR) & 0xFFFF;;
//}
// =============================================================================
// 功能：轮询方式读写数据
// 参数：Reg,寄存器基址，srcAddr,数据源指针；wrSize，写数据量，destAddr，读到的数据
//       地址指针；rdSize，读数据量，recvoff,读偏移，暂未用
// 返回：true,正确；false,错误
// =============================================================================
static bool_t __SPI_TxRxPoll(tagSpiReg *Reg,u8 *srcAddr,u32 wrSize,
        u8 *destAddr, u32 rdSize,u32 recvoff,u8 cs)
{
    u32 i,len_limit;
    u32 SPIPort = 0;
    u8 temp;
    u8 temp1 = 0;
    SPIPort = __SPI_GetPoart(Reg);

    if( (!srcAddr) || ((rdSize != 0) && (!destAddr)))
        return false;

    Reg->CR1 |= SPI_CR1_SPE;

    len_limit = MAX(wrSize, rdSize + recvoff);

    for (i=0;i<len_limit;i++)
    {
        if (i<wrSize)
        {
            // __SPI_Write(Reg,srcAddr[i]);
            HAL_SPI_TransmitReceive(&SPI_Handler[SPIPort], &srcAddr[i], &temp, 1, HAL_MAX_DELAY);
        }
        else if((i>=wrSize)&&(i<len_limit))
        {
        //   __SPI_Write(Reg,0);
            if((destAddr) && (i>=recvoff))
            {
                // destAddr[i-recvoff] = __SPI_Read(Reg);
                HAL_SPI_TransmitReceive(&SPI_Handler[SPIPort], &temp1, &destAddr[i-recvoff], 1, HAL_MAX_DELAY);
            }
            else
            {
                HAL_SPI_TransmitReceive(&SPI_Handler[SPIPort], &temp1, &temp, 1, HAL_MAX_DELAY);
            }
        }

    }
    return true;

}

// =============================================================================
// 功能：SPI底层驱动发送接收函数，本函数完成的功能如下：
//       1.保存结构静态变量，用于中断中使用；
//       2.配置相关的寄存器，使其处于发送接收数据状态;
//       3.开启中断，在中断服务函数中完成数据收发。
// 参数：specific_flag,个性标记，本模块内即IIC寄存器基址
//       sendlen,发送数据长度，字节
//       recvlen,发送数据长度，字节
//       recvoff,接收数据依稀，即从接收到的第几个字节开始保存数据，字节
//       block_opt,阻塞选项，true时，为阻塞，非阻塞方式需底层驱动释放信号量和拉高CS
//       spi_semp,底层可能需要释放的信号量，是否释放由block_opt决定
// 返回：true,无错误;false,失败
// =============================================================================
// static bool_t __SPI_TransferTxRx(tagSpiReg *Reg,u32 sendlen,u32 recvlen,
//                                 u32 recvoff)
// {
//     struct SPI_IntParamSet *Param=NULL;

//     if(Reg == tg_SpiReg[CN_SPI1])
//         Param = &IntParamset1;
//     else if(Reg == tg_SpiReg[CN_SPI2])
//         Param = &IntParamset2;
//     else
//         Param = &IntParamset3;

//     Param->SendDataLen = sendlen;
//     Param->RecvDataLen = recvlen;
//     Param->RecvOffset  = recvoff;

//     __SPI_IntEnable(Reg,SPI_CR2_TXEIE);
//     Reg->CR1 |= SPI_CR1_SPE;

//     return true;
// }
// =============================================================================
// 功能：SPI接收与发送中断服务函数。该函数实现的功能如下：
//       1.由于收发一体，因此发送空中断中也收到了数据；
//       2.SPI_PortRead()中读不到数据时，说明发送的数据已经完成，可关发送中断
//       3.若param->RecvDataLen大于0，即需要接收数据，则从接收到数据领衔offset字节
//         开始存储数据，即调用SPI_PortRead()
//       4.
// 参数：spi_int_line,中断号，本函数没用到
// 返回：无意义
// =============================================================================
// u32 SPI_ISR(ptu32_t IntLine)
// {
//     struct SPI_CB *pSCB=NULL;
//     struct SPI_IntParamSet *param;
//     tagSpiReg *Reg;
//     u32 spi_sr,spi_cr2;
//     u8 ch,temp;
//     static u8 firstrcv = 0;

//     if(IntLine == CN_INT_LINE_SPI1)
//     {
//         pSCB = s_ptSpi1_CB;
//         Reg = (tagSpiReg *)tg_SpiReg[CN_SPI1];
//         param = &IntParamset1;
//     }
//     else if(IntLine == CN_INT_LINE_SPI2)
//     {
//         pSCB = s_ptSpi2_CB;
//         Reg = (tagSpiReg *)tg_SpiReg[CN_SPI2];
//         param = &IntParamset2;
//     }
//     else if(IntLine == CN_INT_LINE_SPI3)
//     {
//         pSCB = s_ptSpi3_CB;
//         Reg = (tagSpiReg *)tg_SpiReg[CN_SPI3];
//         param = &IntParamset3;
//     }
//     else
//         return 0;

