china-djyos/djyos/bsp/cpudrv/stm32/f1/src/spi/cpu_peri_spi.c
//     spi_sr = Reg->SR;
//     spi_cr2 = Reg->CR2;
//     //发送中断
//     if( (spi_cr2 & SPI_CR2_TXEIE) && (spi_sr & SPI_SR_TXE)) //使能了发送中断，且TXRIS
//     {
//         temp = SPI_PortRead(pSCB,&ch,1);//是否还有数据需要发送

//         if(temp >0)
//         {
//             param->SendDataLen --;
//             param->RecvOffset  --;
//             *((__IO u8 *)&Reg->DR) = ch;
//         }
//         else                                            //表明发送结束
//         {
//             //关发送中断
//             __SPI_IntDisable(Reg,SPI_CR2_TXEIE);
//             param->RecvOffset -= param->SendDataLen;
//             param->SendDataLen = 0;

//             ch = *((__IO u8 *)&Reg->DR);

//             //发送完成了，判断是否需要接收
//             if(param->RecvDataLen > 0)
//             {
//                 //MASTER模式下，发送和接收同时进行
//                 *((__IO u8 *)&Reg->DR) = 0xAA;
//                 __SPI_IntEnable(Reg,SPI_CR2_RXNEIE);    //使能接收中断
//                 firstrcv = 1;
//             }
//         }
//     }
//     else if((spi_cr2 & SPI_CR2_RXNEIE) && (spi_sr & SPI_SR_RXNE))    //接收中断
//     {
//         ch =*((__IO u8 *)&Reg->DR);
//         //计算接收了多少数据
//         if(firstrcv != 1)
//         {
//             SPI_PortWrite(pSCB,&ch,1);
//             param->RecvDataLen -= 1;
//         }
//         else
//             firstrcv = 0;

//         //判断是否还需接收数据
//         if(param->RecvDataLen > 0)
//         {
//             *((__IO u8 *)&Reg->DR) = 0xAA;
//         }
//         else                    //表明接收已经完成
//         {
//             param->RecvDataLen = 0;
//             __SPI_IntDisable(Reg,SPI_CR2_RXNEIE);
//         }
//     }

//     if(param->RecvDataLen + param->SendDataLen == 0)
//     {
//         Reg->CR1 &= ~SPI_CR1_SPE;
//     }

//     return 0;
// }

// =============================================================================
// 功能: SPI中断配置函数
// 参数: IntLine,中断线
// 返回: 无
// =============================================================================
// static void __SPI_IntConfig(u8 IntLine)
// {
//     //中断线的初始化
//     Int_Register(IntLine);
//     Int_SetClearType(IntLine,CN_INT_CLEAR_AUTO);
//     Int_IsrConnect(IntLine,SPI_ISR);
//     Int_SettoAsynSignal(IntLine);
//     Int_ClearLine(IntLine);
//     Int_RestoreAsynLine(IntLine);
// }
// =============================================================================
// 功能： 进入或退出低功耗模式
//     时钟使能 控制器使能 GPIO设置相应的状态
// 参数： port 串口号：如 CN_SPI1
//     flag 进入低功耗 或退出低功耗标志：如 SPI_IN_LOWPOWER
// 返回：true/false
// =============================================================================
// bool_t SPI_LowPowerConfig(u8 port,u8 flag)
// {
//     if(port>=CN_SPI_NUM)
//         return false;
//     if(flag == InLowPower)
//     {
//         SPI_InLowPowerPinCfg(port);
//         return true;
//     }
//     else if (flag == OutLowPower)
//     {
//         SPI_OutLowPowerPinCfg(port);
//         return true;
//     }
//    return false;
// }
// =============================================================================
// 功能：SPI底层驱动的初始化，完成整个SPI总线的初始化，其主要工作如下：
//       1.初始化总线控制块SPI_CB，回调函数和缓冲区的初始化赋值；
//       2.默认的硬件初始化，如GPIO或SPI寄存器等；
//       3.中断初始化，完成读写中断配置；
//       4.调用SPIBusAdd或SPIBusAdd_r增加总线结点；
// 参数：无
// 返回：初始化成功返回1，失败返回0
// =============================================================================
bool_t SPI_Initialize(u8 port)
{
    struct SPI_Param SPI_Config;
    struct SPI_CB **pSpiCB;
    u8 IntLine;

    switch(port)
    {
    case CN_SPI1:
        SPI_Config.BusName          = "SPI1";
        SPI_Config.SPIBuf           = (u8*)&s_Spi1_Buf;
        IntLine = CN_INT_LINE_SPI1;
        pSpiCB = &s_ptSpi1_CB;
        break;
    case CN_SPI2:
        SPI_Config.BusName          = "SPI2";
        SPI_Config.SPIBuf           = (u8*)&s_Spi2_Buf;
        IntLine = CN_INT_LINE_SPI2;
        pSpiCB = &s_ptSpi2_CB;
        break;
    case CN_SPI3:
        SPI_Config.BusName          = "SPI3";
        SPI_Config.SPIBuf           = (u8*)&s_Spi3_Buf;
        IntLine = CN_INT_LINE_SPI3;
        pSpiCB = &s_ptSpi3_CB;
        break;
    default:
        return (0);
    }
    SPI_Config.SpecificFlag     = (ptu32_t)tg_SpiReg[port];
    SPI_Config.SPIBufLen        = CFG_SPI_BUF_LEN;
    SPI_Config.MultiCSRegFlag   = false;
    SPI_Config.pTransferPoll    = (TransferPoll)__SPI_TxRxPoll;
    // SPI_Config.pTransferTxRx    = (TransferFunc)__SPI_TransferTxRx;
    SPI_Config.pTransferTxRx    = (TransferFunc)NULL;
    SPI_Config.pCsActive        = (CsActiveFunc)__SPI_BusCsActive;
    SPI_Config.pCsInActive      = (CsInActiveFunc)__SPI_BusCsInActive;
    SPI_Config.pBusCtrl         = (SPIBusCtrlFunc)__SPI_BusCtrl;

    __SPI_HardConfig((u32)SPI_Config.SpecificFlag); // SPI寄存器设置

    // __SPI_IntConfig(IntLine); // 注册中断
    *pSpiCB = SPI_BusAdd(&SPI_Config);
    if(*pSpiCB) // 将SPI端口添加到SPI总线
        return (1);
    else
        return (0);
}
//-----------------------------------------------------------------------------
//功能: 安装SPI端口
//参数: SPI端口号
//返回: -1 -- 失败; 0 -- 成功;
//备注:
//-----------------------------------------------------------------------------
s32 ModuleInstall_SPI(u8 Port)
{
    if(0 == SPI_Initialize(Port))
        return (-1);
    return (0);
}

